# Conductor Size Class

Source: https://www.revitapidocs.com/2026/dde153a1-1058-b9f9-986f-87df26345dfe.htm

---

| Conductor Size Class |
| --- |

This class represents the definition of Conductor Size data. Inheritance Hierarchy System Object
Autodesk.Revit.DB.Electrical ConductorSize

**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class ConductorSize : IDisposable
```

```
Public Class ConductorSize
	Implements IDisposable
```

```
public ref class ConductorSize : IDisposable
```

```
type ConductorSize =
    class
        interface IDisposable
    end
```
The ConductorSize type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Diameter | The diameter of the conductor. |
|  | Id | The Conductor Size id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The Conductor Size name. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a Conductor Size. |
|  | Dispose | Releases all resources used by the ConductorSize |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetConductorSize | Gets the Conductor Size data by given Conductor Size id. |
|  | GetConductorSizeIdByName | Gets the Conductor Size id by given Conductor Size name. |
|  | GetConductorSizeIds | Gets all the Conductor Size ids in the given document, sorted by name. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB.Electrical Namespace